atanisoft/ESP32CommandStation/lib/OpenMRN/src/os/os.c
/** \copyright
 * Copyright (c) 2012, Stuart W Baker
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are  permitted provided that the following conditions are met:
 * 
 *  - Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 *  - Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 * \file os.c
 * This file represents a C language abstraction of common operating
 * system calls.
 *
 * @author Stuart W. Baker
 * @date 13 August 2012
 */

#ifndef _DEFAULT_SOURCE
#define _DEFAULT_SOURCE
#endif

/// Forces one definition of each inline function to be compiled.
#define OS_INLINE extern

#include <stdint.h>
#include <stdio.h>
#include <fcntl.h>
#if !defined (GCC_MEGA_AVR)
#include <unistd.h>
#endif // !GCC_MEGA_AVR

#if defined (__FreeRTOS__)
#include "devtab.h"
#include "FreeRTOS.h"
#include "task.h"

#elif defined(__WIN32__)

#include <winsock2.h>
#include <ws2tcpip.h> /* socklen_t */
#include <time.h>
#include <signal.h>

#elif defined(ESP_NONOS)

#include <sys/select.h>
#include <sched.h>
#include <signal.h>
#include <user_interface.h>

#else

#include <sys/select.h>
#include <sched.h>
#include <time.h>
#include <signal.h>

#endif // switch by OS

#include "nmranet_config.h"

#include "utils/macros.h"
#include "os/os.h"
#include "os/os_private.h"

/** default stdin */
extern const char *STDIN_DEVICE;

/** default stdout */
extern const char *STDOUT_DEVICE;

/** default stderr */
extern const char *STDERR_DEVICE;

/** Captures point of death (line). */
int g_death_lineno;
/** Captures point of death (file). */
const char* g_death_file;

/** clock management **/
long long rtcOffset = 0;

/** This magic value is written to a task's taskList entry in order to signal
 * the idle task to pick it out of the taskList structure. */
#define DELETED_TASK_MAGIC 0xb5c5d5e5

/* This section of code is required because CodeSourcery's mips-gcc
 * distribution contains a strangely compiled NewLib (in the unhosted-libc.a
 * version) that does not forward these function calls to the implementations
 * we have. We are thus forced to override their weak definition of these
 * functions. */
#if defined(TARGET_PIC32MX) || defined(ESP_NONOS)
#include "reent.h"

#ifndef _READ_WRITE_RETURN_TYPE
#define _READ_WRITE_RETURN_TYPE ssize_t
#endif

int open(const char* b, int flags, ...)
{
    return _open_r(_impure_ptr, b, flags, 0);
}
int close(int fd)
{
    return _close_r(_impure_ptr, fd);
}
_READ_WRITE_RETURN_TYPE read(int fd, void* buf, size_t count)
{
    return _read_r(_impure_ptr, fd, buf, count);
}
_READ_WRITE_RETURN_TYPE write(int fd, const void* buf, size_t count)
{
    return _write_r(_impure_ptr, fd, buf, count);
}
off_t lseek(int fd, off_t offset, int whence)
{
    return _lseek_r(_impure_ptr, fd, offset, whence);
}
int fstat(int fd, struct stat* buf)
{
    return _fstat_r(_impure_ptr, fd, buf);
}

#endif


#if defined (__FreeRTOS__)
/// Task list entriy
typedef struct task_list
{
    xTaskHandle task; ///< list entry data
    char * name; ///< name of task
    size_t unused; ///< number of bytes left unused in the stack
    struct task_list *next; ///< next link in the list
} TaskList;

/** Private metadata for starting a thread.
 */
typedef struct
{
    void *(*entry)(void*); /**< thread entry point */
    void *arg; /**< argument to thread */
    TaskList *taskList; /**< task list instance */
} OSThreadStartPriv;

/** List of all the tasks in the system */
static TaskList *taskList = NULL;

/** Mutex for os_thread_once. */
static os_mutex_t onceMutex = OS_MUTEX_INITIALIZER;

/** Default hardware initializer.  This function is defined weak so that
 * a given board can stub in an intiailization specific to it.
 */
void hw_init(void) __attribute__ ((weak));
void hw_init(void)
{
}

/** Default hardware post-initializer.  This function is called from the main
 * task, after the scheduler is started, but before appl_main is invoked. This
 * function is defined weak so that a given board can stub in an intiailization
 * specific to it.
 */
void hw_postinit(void) __attribute__ ((weak));
void hw_postinit(void)
{
}

/** One time intialization routine
 * @param once one time instance
 * @param routine method to call once
 * @return 0 upon success
 */
int os_thread_once(os_thread_once_t *once, void (*routine)(void))
{
    if (xTaskGetSchedulerState() == taskSCHEDULER_RUNNING)
    {
        /* The scheduler has started so we should use locking */
        os_mutex_lock(&onceMutex);
        if (once->state == OS_THREAD_ONCE_NEVER)
        {
            once->state = OS_THREAD_ONCE_INPROGRESS;
            os_mutex_unlock(&onceMutex);
            routine();
            os_mutex_lock(&onceMutex);
            once->state = OS_THREAD_ONCE_DONE;
        }

        while (once->state == OS_THREAD_ONCE_INPROGRESS)
        {
            /* avoid dead lock waiting for PTHREAD_ONCE_DONE state */
            os_mutex_unlock(&onceMutex);
            usleep(MSEC_TO_USEC(10));
            os_mutex_lock(&onceMutex);
        }
        os_mutex_unlock(&onceMutex);
    }
    else
    {
        /* this is for static constructures before the scheduler is started */
        if (once->state == OS_THREAD_ONCE_NEVER)
        {
            once->state = OS_THREAD_ONCE_INPROGRESS;
            routine();
            once->state = OS_THREAD_ONCE_DONE;
        }
    }

