atanisoft/ESP32CommandStation/lib/OpenMRN/src/os/os.c
    return 0;
}
#elif defined (__WIN32__)
/** Windows does not support pipes, so we made our own with a pseudo socketpair.
 * @param fildes fildes[0] is open for reading, filedes[1] is open for writing
 * @return 0 upon success, else -1 with errno set to indicate error
 */
int pipe(int fildes[2])
{
    struct sockaddr_in addr;  
    int listener, connector, acceptor;
    socklen_t addrlen = sizeof(addr);

    if ((listener = socket(AF_INET, SOCK_STREAM, 0)) <= 0)
    {
        errno = EMFILE;
        return -1;
    }
    if ((connector = socket(AF_INET, SOCK_STREAM, 0)) <= 0)
    {
        closesocket(listener);
        errno = EMFILE;
        return -1;
    }
    
    memset(&addr, 0, sizeof(addr));
    addr.sin_family = AF_INET;
    addr.sin_addr.s_addr = htonl(INADDR_LOOPBACK);
    addr.sin_port = 0; 

    int reuse = 0;
    if (setsockopt(listener, SOL_SOCKET, SO_REUSEADDR, 
                   (char*)&reuse, (socklen_t)sizeof(reuse)) < 0)
    {
        closesocket(listener);
        closesocket(connector);
        errno = EMFILE;
        return -1;
    }

    if (bind(listener, (const struct sockaddr*)&addr, sizeof(addr)) < 0)
    {
        closesocket(listener);
        closesocket(connector);
        errno = EMFILE;
        return -1;
    }
    
    if  (getsockname(listener, (struct sockaddr*)&addr, &addrlen) < 0)
    {
        closesocket(listener);
        closesocket(connector);
        errno = EMFILE;
        return -1;
    }

    if (listen(listener, 1) < 0)
    {
        closesocket(listener);
        closesocket(connector);
        errno = EMFILE;
        return -1;
    }

    if (connect(connector, (const struct sockaddr*)&addr, addrlen) < 0)
    {
        closesocket(listener);
        closesocket(connector);
        errno = EMFILE;
        return -1;
    }
   
    if ((acceptor = accept(listener, NULL, NULL)) < 0)
    {
        closesocket(listener);
        closesocket(connector);
        errno = EMFILE;
        return  -1;
    }

    int flag = 1;
    setsockopt(connector, IPPROTO_TCP, TCP_NODELAY, (char*)&flag, sizeof(int));
    setsockopt(acceptor, IPPROTO_TCP, TCP_NODELAY, (char*)&flag, sizeof(int));

    fildes[0] = connector;
    fildes[1] = acceptor;
    closesocket(listener);
    return 0;
}
#endif

#if defined (__FreeRTOS__)
extern const void* stack_malloc(unsigned long length);

/** Add a thread to the task list for tracking.
 * @param task_new metadata for new task
 */
void add_thread_to_task_list(TaskList *task_new)
{
    vTaskSuspendAll();
    task_new->next = taskList;
    taskList = task_new;
    xTaskResumeAll();
}

/** Delete a thread from the task list for tracking.
 * @param task_handle FreeRTOS task handle to delete
 */
void del_thread_from_task_list(TaskHandle_t task_handle)
{
    vTaskSuspendAll();
    TaskList *tl;
    for (tl = taskList; tl != NULL && tl->task != task_handle; tl = tl->next)
    {
    }
    if (tl)
    {
        tl->task = NULL;
        tl->name = NULL;
        tl->unused = DELETED_TASK_MAGIC;
    }
    xTaskResumeAll();
}

/** Do any platform specific work at the beginning of os_thread_start().
 */
void __attribute__((weak)) os_thread_start_entry_hook(void)
{
}

/** Do any platform specific work at the end of os_thread_start().
 * @param thread return context
 */
void __attribute__((weak)) os_thread_start_exit_hook(void *context)
{
    vTaskDelete(NULL);
}

/** Entry point to a thread.
 * @param arg metadata for entering the thread
 */
void os_thread_start(void *arg)
{
    os_thread_start_entry_hook();

    // add ourselves to the task list
    OSThreadStartPriv *priv = (OSThreadStartPriv*)arg;
    priv->taskList->task = xTaskGetCurrentTaskHandle();
    add_thread_to_task_list(priv->taskList);

#if OPENMRN_FEATURE_DEVICE_SELECT    
    // init thread local storage to
#if tskKERNEL_VERSION_MAJOR >= 9
    // FreeRTOS 9.x+ implementation
    vTaskSetThreadLocalStoragePointer(NULL, TLS_INDEX_SELECT_EVENT_BIT, NULL);
#else
    // legacy implementation uses task tag
    vTaskSetApplicationTaskTag(NULL, NULL);
#endif
#endif

    // execute thread entry point
    void *result = (*priv->entry)(priv->arg);

    // remove ourselves from task list
    del_thread_from_task_list(xTaskGetCurrentTaskHandle());

    // We purposesly do not free priv->taskList.  Though it is technically a
    // leak, we keep it around for diagnostic purposes.

    free(arg);

    os_thread_start_exit_hook(result);
}
#endif

#if !(defined(__EMSCRIPTEN__) || defined(ESP_NONOS) || defined(ARDUINO))

#if defined(__FreeRTOS__)
/** Create a thread helper.
 * @param thread handle to the created thread
 * @param name name of thread, NULL for an auto generated name
 * @param priority priority of created thread, 0 means default,
 *        lower numbers means lower priority, higher numbers mean higher priority
 * @param stack_size size in bytes of the created thread's stack
 * @param priv thread matadata parameter
 * @return 0 upon success or error number upon failure
 */
int __attribute__((weak)) os_thread_create_helper(os_thread_t *thread,
                                                  const char *name,
                                                  int priority,
                                                  size_t stack_size,
                                                  void *priv)
{
    HASSERT(thread);
#if (configSUPPORT_STATIC_ALLOCATION == 1)
    *thread = xTaskCreateStatic(os_thread_start, (const char *const)name,
                                stack_size/sizeof(portSTACK_TYPE), priv,
                                priority,
                                (StackType_t *)stack_malloc(stack_size),
                                (StaticTask_t *) malloc(sizeof(StaticTask_t)));
    task_new->task = *thread;
    task_new->name = (char*)pcTaskGetTaskName(*thread);
#elif (configSUPPORT_DYNAMIC_ALLOCATION == 1)
    xTaskCreate(os_thread_start, (const char *const)name,
                stack_size/sizeof(portSTACK_TYPE), priv, priority, thread);
#else
#error FREERTOS version v9.0.0 or later required
#endif
    return 0;
}
#endif // FreeRTOS

/** Create a thread.
 * @param thread handle to the created thread
 * @param name name of thread, NULL for an auto generated name
 * @param priority priority of created thread, 0 means default,
 *        lower numbers means lower priority, higher numbers mean higher priority
 * @param stack_size size in bytes of the created thread's stack
 * @param start_routine entry point of the thread
 * @param arg entry parameter to the thread
 * @return 0 upon success or error number upon failure
 */
int os_thread_create(os_thread_t *thread, const char *name, int priority,
                     size_t stack_size, void *(*start_routine) (void *),
                     void *arg)
{
    static unsigned int count = 0;
    char auto_name[10];

    if (name == NULL)
    {
        strcpy(auto_name, "thread.");
        auto_name[9] = '\0';
        auto_name[8] = '0' + (count % 10);
        auto_name[7] = '0' + (count / 10);
        count++;
        name = auto_name;
    }

#if defined (__FreeRTOS__)
    OSThreadStartPriv *priv =
        (OSThreadStartPriv*)malloc(sizeof(OSThreadStartPriv));

    priv->taskList = (TaskList*)malloc(sizeof(TaskList));
    priv->taskList->name = NULL;
    priv->entry = start_routine;
    priv->arg = arg;

